window.onload=function(){
	var company = document.getElementsByClassName('company');
	var companyIntroduction = document.getElementsByClassName('companyIntroduction');
		
	
	var arr=[{
		a:'25',
		b:'34',
		c:'17084172229',
		d:'河南省洛阳市涧西区洛阳市涧西区南昌路六街坊6号院11幢1-1003',
		e:'周一~周日,每天09:00-22:00',
		f:'全部价位',
		g:'吉利区、涧西区、洛龙区、西工区',
		h:'洛阳易居装饰有限公司成立于2005年，原名为河南易居装饰洛阳分公司，是河南本土成立最早的装饰公司之一，也是目前河南本土最具实力的装饰公司之一，易居装饰是一个集公装、家装设计、施工、材料配送、售后服务为一体的全方位服务基地。公司拥有大型材料配送中心、精品橱柜加工厂、门窗套加工车间，真正实现了工程项目装修和家庭装饰、家居生活一体化洛阳易居装饰有限公司成立于2005年，原名为河南易居装饰洛阳分公司，是河南本土成立最早的装饰公司之一，也是目前河南本土最具实力的装饰公司之一，易居装饰是一个集公装、家装设计、施工、材料配送、售后服务为一体的全方位服务基地。公司拥有大型材料配送中心、精品橱柜加工厂、门窗套加工车间，真正实现了工程项目装修和家庭装饰、家居生活一体化洛阳易居装饰有限公司成立于2005年，原名为河南易居装饰洛阳分公司，是河南本土成立最早的装饰公司之一，也是目前河南本土最具实力的装饰公司之一，易居装饰是一个集公装、家装设计、施工、材料配送、售后服务为一体的全方位服务基地。公司拥有大型材料配送中心、精品橱柜加工厂、门窗套加工车间，真正实现了工程项目装修和家庭装饰、家居生活一体化洛阳易居装饰有限公司成立于2005年，原名为河南易居装饰洛阳分公司，是河南本土成立最早的装饰公司之一，也是目前河南本土最具实力的装饰公司之一，易居装饰是一个集公装、家装设计、施工、材料配送、售后服务为一体的全方位服务基地。公司拥有大型材料配送中心、精品橱柜加工厂、门窗套加工车间，真正实现了工程项目装修和家庭装饰、家居生活一体化洛阳易居装饰有限公司成立于2005年，原名为河南易居装饰洛阳分公司，是河南本土成立最早的装饰公司之一，也是目前河南本土最具实力的装饰公司之一，易居装饰是一个集公装、家装设计、施工、材料配送、售后服务为一体的全方位服务基地。公司拥有大型材料配送中心、精品橱柜加工厂、门窗套加工车间，真正实现了工程项目装修和家庭装饰、家居生活一体化洛阳易居装饰有限公司成立于2005年，原名为河南易居装饰洛阳分公司，是河南本土成立最早的装饰公司之一，也是目前河南本土最具实力的装饰公司之一，易居装饰是一个集公装、家装设计、施工、材料配送、售后服务为一体的全方位服务基地。公司拥有大型材料配送中心、精品橱柜加工厂、门窗套加工车间，真正实现了工程项目装修和家庭装饰、家居生活一体化洛阳易居装饰有限公司成立于2005年，原名为河南易居装饰洛阳分公司，是河南本土成立最早的装饰公司之一，也是目前河南本土最具实力的装饰公司之一，易居装饰是一个集公装、家装设计、施工、材料配送、售后服务为一体的全方位服务基地。公司拥有大型材料配送中心、精品橱柜加工厂、门窗套加工车间，真正实现了工程项目装修和家庭装饰、家居生活一体化洛阳易居装饰有限公司成立于2005年，原名为河南易居装饰洛阳分公司，是河南本土成立最早的装饰公司之一，也是目前河南本土最具实力的装饰公司之一，易居装饰是一个集公装、家装设计、施工、材料配送、售后服务为一体的全方位服务基地。公司拥有大型材料配送中心、精品橱柜加工厂、门窗套加工车间，真正实现了工程项目装修和家庭装饰、家居生活一体化洛阳易居装饰有限公司成立于2005年，原名为河南易居装饰洛阳分公司，是河南本土成立最早的装饰公司之一，也是目前河南本土最具实力的装饰公司之一，易居装饰是一个集公装、家装设计、施工、材料配送、售后服务为一体的全方位服务基地。公司拥有大型材料配送中心、精品橱柜加工厂、门窗套加工车间，真正实现了工程项目装修和家庭装饰、家居生活一体化洛阳易居装饰有限公司成立于2005年，原名为河南易居装饰洛阳分公司，是河南本土成立最早的装饰公司之一，也是目前河南本土最具实力的装饰公司之一，易居装饰是一个集公装、家装设计、施工、材料配送、售后服务为一体的全方位服务基地。公司拥有大型材料配送中心、精品橱柜加工厂、门窗套加工车间，真正实现了工程项目装修和家庭装饰、家居生活一体化洛阳易居装饰有限公司成立于2005年，原名为河南易居装饰洛阳分公司，是河南本土成立最早的装饰公司之一，也是目前河南本土最具实力的装饰公司之一，易居装饰是一个集公装、家装设计、施工、材料配送、售后服务为一体的全方位服务基地。公司拥有大型材料配送中心、精品橱柜加工厂、门窗套加工车间，真正实现了工程项目装修和家庭装饰、家居生活一体化洛阳易居装饰有限公司成立于2005年，原名为河南易居装饰洛阳分公司，是河南本土成立最早的装饰公司之一，也是目前河南本土最具实力的装饰公司之一，易居装饰是一个集公装、家装设计、施工、材料配送、售后服务为一体的全方位服务基地。公司拥有大型材料配送中心、精品橱柜加工厂、门窗套加工车间，真正实现了工程项目装修和家庭装饰、家居生活一体化洛阳易居装饰有限公司成立于2005年，原名为河南易居装饰洛阳分公司，是河南本土成立最早的装饰公司之一，也是目前河南本土最具实力的装饰公司之一，易居装饰是一个集公装、家装设计、施工、材料配送、售后服务为一体的全方位服务基地。公司拥有大型材料配送中心、精品橱柜加工厂、门窗套加工车间，真正实现了工程项目装修和家庭装饰、家居生活一体化洛阳易居装饰有限公司成立于2005年，原名为河南易居装饰洛阳分公司，是河南本土成立最早的装饰公司之一，也是目前河南本土最具实力的装饰公司之一，易居装饰是一个集公装、家装设计、施工、材料配送、售后服务为一体的全方位服务基地。公司拥有大型材料配送中心、精品橱柜加工厂、门窗套加工车间，真正实现了工程项目装修和家庭装饰、家居生活一体化洛阳易居装饰有限公司成立于2005年，原名为河南易居装饰洛阳分公司，是河南本土成立最早的装饰公司之一，也是目前河南本土最具实力的装饰公司之一，易居装饰是一个集公装、家装设计、施工、材料配送、售后服务为一体的全方位服务基地。公司拥有大型材料配送中心、精品橱柜加工厂、门窗套加工车间，真正实现了工程项目装修和家庭装饰、家居生活一体化洛阳易居装饰有限公司成立于2005年，原名为河南易居装饰洛阳分公司，是河南本土成立最早的装饰公司之一，也是目前河南本土最具实力的装饰公司之一，易居装饰是一个集公装、家装设计、施工、材料配送、售后服务为一体的全方位服务基地。公司拥有大型材料配送中心、精品橱柜加工厂、门窗套加工车间，真正实现了工程项目装修和家庭装饰、家居生活一体化洛阳易居装饰有限公司成立于2005年，原名为河南易居装饰洛阳分公司，是河南本土成立最早的装饰公司之一，也是目前河南本土最具实力的装饰公司之一，易居装饰是一个集公装、家装设计、施工、材料配送、售后服务为一体的全方位服务基地。公司拥有大型材料配送中心、精品橱柜加工厂、门窗套加工车间，真正实现了工程项目装修和家庭装饰、家居生活一体化洛阳易居装饰有限公司成立于2005年，原名为河南易居装饰洛阳分公司，是河南本土成立最早的装饰公司之一，也是目前河南本土最具实力的装饰公司之一，易居装饰是一个集公装、家装设计、施工、材料配送、售后服务为一体的全方位服务基地。公司拥有大型材料配送中心、精品橱柜加工厂、门窗套加工车间，真正实现了工程项目装修和家庭装饰、家居生活一体化洛阳易居装饰有限公司成立于2005年，原名为河南易居装饰洛阳分公司，是河南本土成立最早的装饰公司之一，也是目前河南本土最具实力的装饰公司之一，易居装饰是一个集公装、家装设计、施工、材料配送、售后服务为一体的全方位服务基地。公司拥有大型材料配送中心、精品橱柜加工厂、门窗套加工车间，真正实现了工程项目装修和家庭装饰、家居生活一体化'
	},
	{
		a:'406',
		b:'16',
		c:'17084172229',
		d:'河南省洛阳市涧西区西苑路21号门面房',
		e:'周一~周日,每天08:00-22:00',
		f:'3-100万以上',
		g:'廛河回族区、吉利区、涧西区、老城区、洛龙区、西工区、偃师市...',
		h:'洛阳檀梓装饰工程有限公司，成立于2016年。“檀梓”是世界上最名贵的木材之一，“梓”用技术精湛的工匠、木匠进行制作，表达了企业欲用上等精品的材料，技术精湛的工匠，为我们的客户打造一个完美的家。'
	},
	{
		a:'9',
		b:'4',
		c:'13177502584',
		d:'河南省嵩县白云大道二桥凤凰大厦二楼20',
		e:'周一~周日,每天09:00-22:00',
		f:'全部价位',
		g:'嵩县',
		h:'英凰装饰,实力品牌,高品质装修团队,专业设计团队,一线环保建材,质量保您满意,终身VIP维护制度,还可现场免费参观样板房!'
	},
	{
		a:'2792',
		b:'3233',
		c:'17084172229',
		d:'河南省洛阳市涧西区西苑路21号门面房',
		e:'周一~周日,每天09:00-22:00',
		f:'全部价位',
		g:'吉利区、涧西区、洛龙区、西工区',
		h:'洛阳易居装饰有限公司成立于2005年，原名为河南易居装饰洛阳分公司，是河南本土成立最早的装饰公司之一，也是目前河南本土最具实力的装饰公司之一，易居装饰是一个集公装、家装设计、施工、材料配送、售后服务为一体的全方位服务基地。公司拥有大型材料配送中心、精品橱柜加工厂、门窗套加工车间，真正实现了工程项目装修和家庭装饰、家居生活一体化'
	},
	{
		a:'2792',
		b:'3233',
		c:'17084172229',
		d:'河南省洛阳市涧西区西苑路21号门面房',
		e:'周一~周日,每天09:00-22:00',
		f:'全部价位',
		g:'吉利区、涧西区、洛龙区、西工区',
		h:'洛阳易居装饰有限公司成立于2005年，原名为河南易居装饰洛阳分公司，是河南本土成立最早的装饰公司之一，也是目前河南本土最具实力的装饰公司之一，易居装饰是一个集公装、家装设计、施工、材料配送、售后服务为一体的全方位服务基地。公司拥有大型材料配送中心、精品橱柜加工厂、门窗套加工车间，真正实现了工程项目装修和家庭装饰、家居生活一体化'
	},
	{
		a:'2792',
		b:'3233',
		c:'17084172229',
		d:'河南省洛阳市涧西区西苑路21号门面房',
		e:'周一~周日,每天09:00-22:00',
		f:'全部价位',
		g:'吉利区、涧西区、洛龙区、西工区',
		h:'洛阳易居装饰有限公司成立于2005年，原名为河南易居装饰洛阳分公司，是河南本土成立最早的装饰公司之一，也是目前河南本土最具实力的装饰公司之一，易居装饰是一个集公装、家装设计、施工、材料配送、售后服务为一体的全方位服务基地。公司拥有大型材料配送中心、精品橱柜加工厂、门窗套加工车间，真正实现了工程项目装修和家庭装饰、家居生活一体化'
	},
	{
		a:'2792',
		b:'3233',
		c:'17084172229',
		d:'河南省洛阳市涧西区西苑路21号门面房',
		e:'周一~周日,每天09:00-22:00',
		f:'全部价位',
		g:'吉利区、涧西区、洛龙区、西工区',
		h:'洛阳易居装饰有限公司成立于2005年，原名为河南易居装饰洛阳分公司，是河南本土成立最早的装饰公司之一，也是目前河南本土最具实力的装饰公司之一，易居装饰是一个集公装、家装设计、施工、材料配送、售后服务为一体的全方位服务基地。公司拥有大型材料配送中心、精品橱柜加工厂、门窗套加工车间，真正实现了工程项目装修和家庭装饰、家居生活一体化'
	},
	{
		a:'2792',
		b:'3233',
		c:'17084172229',
		d:'河南省洛阳市涧西区西苑路21号门面房',
		e:'周一~周日,每天09:00-22:00',
		f:'全部价位',
		g:'吉利区、涧西区、洛龙区、西工区',
		h:'洛阳易居装饰有限公司成立于2005年，原名为河南易居装饰洛阳分公司，是河南本土成立最早的装饰公司之一，也是目前河南本土最具实力的装饰公司之一，易居装饰是一个集公装、家装设计、施工、材料配送、售后服务为一体的全方位服务基地。公司拥有大型材料配送中心、精品橱柜加工厂、门窗套加工车间，真正实现了工程项目装修和家庭装饰、家居生活一体化'
	},
	{
		a:'2792',
		b:'3233',
		c:'17084172229',
		d:'河南省洛阳市涧西区西苑路21号门面房',
		e:'周一~周日,每天09:00-22:00',
		f:'全部价位',
		g:'吉利区、涧西区、洛龙区、西工区',
		h:'洛阳易居装饰有限公司成立于2005年，原名为河南易居装饰洛阳分公司，是河南本土成立最早的装饰公司之一，也是目前河南本土最具实力的装饰公司之一，易居装饰是一个集公装、家装设计、施工、材料配送、售后服务为一体的全方位服务基地。公司拥有大型材料配送中心、精品橱柜加工厂、门窗套加工车间，真正实现了工程项目装修和家庭装饰、家居生活一体化'
	},
	{
		a:'2792',
		b:'3233',
		c:'17084172229',
		d:'河南省洛阳市涧西区西苑路21号门面房',
		e:'周一~周日,每天09:00-22:00',
		f:'全部价位',
		g:'吉利区、涧西区、洛龙区、西工区',
		h:'洛阳易居装饰有限公司成立于2005年，原名为河南易居装饰洛阳分公司，是河南本土成立最早的装饰公司之一，也是目前河南本土最具实力的装饰公司之一，易居装饰是一个集公装、家装设计、施工、材料配送、售后服务为一体的全方位服务基地。公司拥有大型材料配送中心、精品橱柜加工厂、门窗套加工车间，真正实现了工程项目装修和家庭装饰、家居生活一体化'
	},
	{
		a:'2792',
		b:'3233',
		c:'17084172229',
		d:'河南省洛阳市涧西区西苑路21号门面房',
		e:'周一~周日,每天09:00-22:00',
		f:'全部价位',
		g:'吉利区、涧西区、洛龙区、西工区',
		h:'洛阳易居装饰有限公司成立于2005年，原名为河南易居装饰洛阳分公司，是河南本土成立最早的装饰公司之一，也是目前河南本土最具实力的装饰公司之一，易居装饰是一个集公装、家装设计、施工、材料配送、售后服务为一体的全方位服务基地。公司拥有大型材料配送中心、精品橱柜加工厂、门窗套加工车间，真正实现了工程项目装修和家庭装饰、家居生活一体化'
	},
	{
		a:'2792',
		b:'3233',
		c:'17084172229',
		d:'河南省洛阳市涧西区西苑路21号门面房',
		e:'周一~周日,每天09:00-22:00',
		f:'全部价位',
		g:'吉利区、涧西区、洛龙区、西工区',
		h:'洛阳易居装饰有限公司成立于2005年，原名为河南易居装饰洛阳分公司，是河南本土成立最早的装饰公司之一，也是目前河南本土最具实力的装饰公司之一，易居装饰是一个集公装、家装设计、施工、材料配送、售后服务为一体的全方位服务基地。公司拥有大型材料配送中心、精品橱柜加工厂、门窗套加工车间，真正实现了工程项目装修和家庭装饰、家居生活一体化'
	}
	];
	
	function getJson(x){
			companyIntroduction[0].innerText=arr[x].a;
			companyIntroduction[1].innerText=arr[x].b;
			companyIntroduction[2].innerText=arr[x].c
			companyIntroduction[3].innerText=arr[x].d
			companyIntroduction[4].innerText=arr[x].e
			companyIntroduction[5].innerText=arr[x].f
			companyIntroduction[6].innerText=arr[x].g
			companyIntroduction[7].innerText=arr[x].h
	}
	
	switch(company[0].children[0].innerText){
		case '易居装饰':
			getJson(0);
		break;
		case '檀梓装饰':
			getJson(1);
		break;
		case '英凰装饰':
			getJson(2);
		break;
		case '谷一装饰设计':
			getJson(3);
		break;
		case '优耐特装饰':
			getJson(4);
		break;
		case '尚匠装饰':
			getJson(5);
		break;
		case '洛阳十佳装饰':
			getJson(6);
		break;
		case '洛阳林峰装饰':
			getJson(7);
		break;
	} 
};